Repository: xcv58/MacTools
Catalog: Plugins/Translator/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# action.unavailable.accessibility
source: 需要辅助功能授权。
ar: يلزم منح إذن تسهيلات الاستخدام.
de: Bedienungshilfen-Berechtigung erforderlich.
en: Accessibility permission is required.
es: Se requiere permiso de accesibilidad.
fr: L’autorisation d’accessibilité est requise.
ja: アクセシビリティの許可が必要です。
ko: 손쉬운 사용 권한이 필요합니다.
pt: A permissão de acessibilidade é necessária.
ru: Требуется разрешение на универсальный доступ.
tr: Erişilebilirlik izni gerekli.
zh_hant: 需要輔助使用權限。

# action.unavailable.paused
source: 翻译快捷键已暂停。
ar: اختصارات الترجمة متوقفة مؤقتًا.
de: Übersetzungs-Kurzbefehle sind pausiert.
en: Translation shortcuts are paused.
es: Los atajos de traducción están en pausa.
fr: Les raccourcis de traduction sont en pause.
ja: 翻訳ショートカットは一時停止中です。
ko: 번역 단축키가 일시 정지되었습니다.
pt: Os atalhos de tradução estão pausados.
ru: Сочетания клавиш перевода приостановлены.
tr: Çeviri kısayolları duraklatıldı.
zh_hant: 翻譯快速鍵已暫停。

# action.unavailable.screenRecording
source: 需要屏幕录制授权。
ar: يلزم منح إذن تسجيل الشاشة.
de: Bildschirmaufnahme-Berechtigung erforderlich.
en: Screen Recording permission is required.
es: Se requiere permiso de grabación de pantalla.
fr: L’autorisation d’enregistrement de l’écran est requise.
ja: 画面収録の許可が必要です。
ko: 화면 기록 권한이 필요합니다.
pt: A permissão de gravação de tela é necessária.
ru: Требуется разрешение на запись экрана.
tr: Ekran Kaydı izni gerekli.
zh_hant: 需要螢幕錄製權限。

# capture.error.automationFailed
source: 自动化取词失败
ar: فشلت أتمتة المتصفح
de: Browser-Automatisierung fehlgeschlagen
en: Browser automation failed
es: Error en la automatización del navegador
fr: Échec de l'automatisation du navigateur
ja: ブラウザの自動化に失敗しました
ko: 브라우저 자동화 실패
pt: Falha na automação do navegador
ru: Ошибка автоматизации браузера
tr: Tarayıcı otomasyonu başarısız oldu
zh_hant: 自動化取詞失敗

# capture.error.automationTimeout
source: 自动化取词超时
ar: انتهت مهلة أتمتة المتصفح
de: Zeitüberschreitung bei der Browserautomatisierung
en: Browser automation timed out
es: Se agotó el tiempo de espera de la automatización del navegador
fr: L'automatisation du navigateur a expiré
ja: ブラウザの自動化がタイムアウトしました
ko: 브라우저 자동화 시간 초과
pt: A automação do navegador expirou
ru: Время ожидания автоматизации браузера истекло
tr: Tarayıcı otomasyonu zaman aşımına uğradı
zh_hant: 自動化取詞超時

# capture.error.invalidAutomationScript
source: 自动化脚本无效
ar: البرنامج النصي للتشغيل الآلي غير صالح
de: Automatisierungsskript ist ungültig
en: Automation script is invalid
es: El script de automatización no es válido
fr: Le script d'automatisation n'est pas valide
ja: 自動化スクリプトが無効です
ko: 자동화 스크립트가 잘못되었습니다
pt: O script de automação é inválido
ru: Скрипт автоматизации недействителен
tr: Otomasyon betiği geçersiz
zh_hant: 自動化腳本無效

# capture.error.missingApplication
source: 未找到当前应用
ar: لم يتم العثور على التطبيق الحالي
de: Aktuelle App nicht gefunden
en: Current app not found
es: Aplicación actual no encontrada
fr: Application actuelle introuvable
ja: 現在のアプリが見つかりません
ko: 현재 앱을 찾을 수 없습니다
pt: Aplicativo atual não encontrado
ru: Текущее приложение не найдено
tr: Geçerli uygulama bulunamadı
zh_hant: 未找到當前應用

# capture.error.missingSelection
source: 未找到选中文本
ar: لم يتم العثور على نص محدد
de: Kein ausgewählter Text gefunden
en: No selected text found
es: No se encontró ningún texto seleccionado
fr: Aucun texte sélectionné trouvé
ja: 選択したテキストが見つかりません
ko: 선택한 텍스트를 찾을 수 없습니다
pt: Nenhum texto selecionado encontrado
ru: Выделенный текст не найден
tr: Seçili metin bulunamadı
zh_hant: 未找到選中文本

# capture.error.permissionRequired
source: 需要辅助功能授权
ar: مطلوب إذن الوصول
de: Zugriffsberechtigung erforderlich
en: Accessibility permission required
es: Se requiere permiso de accesibilidad
fr: Autorisation d'accessibilité requise
ja: アクセシビリティ許可が必要です
ko: 접근성 권한이 필요합니다
pt: É necessária permissão de acessibilidade
ru: Требуется разрешение на доступ
tr: Erişilebilirlik izni gerekli
zh_hant: 需要輔助使用授權

# capture.error.restorePasteboardFailed
source: 无法恢复剪贴板
ar: تعذرت استعادة لوحة اللصق
de: Das Pasteboard konnte nicht wiederhergestellt werden
en: Could not restore the pasteboard
es: No se pudo restaurar el tablero
fr: Impossible de restaurer la table de montage
ja: ペーストボードを復元できませんでした
ko: 대지를 복원할 수 없습니다
pt: Não foi possível restaurar a área de transferência
ru: Не удалось восстановить монтажный стол
tr: Pano geri yüklenemedi
zh_hant: 無法恢復剪貼板

# capture.error.simulatedCopyFailed
source: 模拟复制失败
ar: فشلت النسخة المحاكاة
de: Simuliertes Kopieren fehlgeschlagen
en: Simulated copy failed
es: Error en la copia simulada
fr: Échec de la copie simulée
ja: シミュレートされたコピーが失敗しました
ko: 시뮬레이션 복사 실패
pt: Falha na cópia simulada
ru: Не удалось смоделировать копирование
tr: Simüle edilen kopyalama başarısız oldu
zh_hant: 模擬複製失敗

# capture.error.unsupportedBrowserAutomation
source: 当前浏览器不支持自动化取词
ar: المتصفح الحالي لا يدعم الالتقاط التلقائي
de: Der aktuelle Browser unterstützt keine Automatisierungserfassung
en: Current browser does not support automation capture
es: El navegador actual no admite la captura automatizada
fr: Le navigateur actuel ne prend pas en charge la capture automatisée
ja: 現在のブラウザはオートメーション キャプチャをサポートしていません
ko: 현재 브라우저는 자동화 캡처를 지원하지 않습니다
pt: O navegador atual não suporta captura automatizada
ru: Текущий браузер не поддерживает автоматический захват
tr: Geçerli tarayıcı otomasyonla yakalamayı desteklemiyor
zh_hant: 當前瀏覽器不支持自動化取詞

# language.automatic
source: 自动检测
ar: الكشف التلقائي
de: Automatische Erkennung
en: Auto Detect
es: Detección automática
fr: Détection automatique
ja: 自動検出
ko: 자동 감지
pt: Detecção automática
ru: Автоопределение
tr: Otomatik Algıla
zh_hant: 自動檢測

# language.automaticTarget
source: 自动选择
ar: تحديد تلقائي
de: Automatische Auswahl
en: Auto Select
es: Selección automática
fr: Sélection automatique
ja: 自動選択
ko: 자동 선택
pt: Seleção automática
ru: Автоматический выбор
tr: Otomatik Seç
zh_hant: 自動選擇

# language.english
source: 英语
ar: الإنجليزية
de: Englisch
en: English
es: inglés
fr: Anglais
ja: 英語
ko: 영어
pt: Inglês
ru: Английский
tr: İngilizce
zh_hant: 英語

# language.french
source: 法语
ar: الفرنسية
de: Französisch
en: French
es: francés
fr: Français
ja: フランス語
ko: 프랑스어
pt: Francês
ru: Французский
tr: Fransızca
zh_hant: 法語

# language.german
source: 德语
ar: الألمانية
de: Deutsch
en: German
es: Alemán
fr: Allemand
ja: ドイツ語
ko: 독일어
pt: Alemão
ru: Немецкий
tr: Almanca
zh_hant: 德語

# language.italian
source: 意大利语
ar: الإيطالية
de: Italienisch
en: Italian
es: Italiano
fr: Italien
ja: イタリア語
ko: 이탈리아어
pt: Italiano
ru: Итальянский
tr: İtalyanca
zh_hant: 意大利語

# language.japanese
source: 日语
ar: اليابانية
de: Japanisch
en: Japanese
es: Japonés
fr: Japonais
ja: 日本語
ko: 일본어
pt: Japonês
ru: Японский
tr: Japonca
zh_hant: 日語

# language.korean
source: 韩语
ar: الكورية
de: Koreanisch
en: Korean
es: coreano
fr: Coréen
ja: 韓国語
ko: 한국어
pt: Coreano
ru: Корейский
tr: Korece
zh_hant: 韓語

# language.portuguese
source: 葡萄牙语
ar: البرتغالية
de: Portugiesisch
en: Portuguese
es: portugués
fr: Portugais
ja: ポルトガル語
ko: 포르투갈어
pt: Português
ru: Португальский
tr: Portekizce
zh_hant: 葡萄牙語

# language.russian
source: 俄语
ar: الروسية
de: Russisch
en: Russian
es: ruso
fr: Russe
ja: ロシア語
ko: 러시아어
pt: Russo
ru: Русский
tr: Rusça
zh_hant: 俄語

# language.simplifiedChinese
source: 简体中文
ar: الصينية المبسطة
de: Vereinfachtes Chinesisch
en: Simplified Chinese
es: Chino simplificado
fr: Chinois simplifié
ja: 簡体字中国語
ko: 중국어(간체)
pt: Chinês Simplificado
ru: Упрощенный китайский
tr: Basitleştirilmiş Çince
zh_hant: 簡體中文

# language.spanish
source: 西班牙语
ar: الإسبانية
de: Spanisch
en: Spanish
es: Español
fr: Espagnol
ja: スペイン語
ko: 스페인어
pt: Espanhol
ru: Испанский
tr: İspanyolca
zh_hant: 西班牙語

# language.traditionalChinese
source: 繁體中文
ar: الصينية التقليدية
de: Traditionelles Chinesisch
en: Traditional Chinese
es: Chino tradicional
fr: Chinois traditionnel
ja: 繁体字中国語
ko: 중국어 번체
pt: Chinês Tradicional
ru: Традиционный китайский
tr: Geleneksel Çince

# metadata.description
source: 划词与截图快捷键翻译
ar: ترجم النص المحدد أو مناطق لقطة الشاشة باستخدام اختصارات
de: Ausgewählten Text oder Screenshot-Bereiche per Kurzbefehl übersetzen
en: Translate selected text or screenshot regions with shortcuts
es: Traduce texto seleccionado o regiones de captura con atajos
fr: Traduit le texte sélectionné ou des zones de capture d’écran avec des raccourcis
ja: 選択したテキストやスクリーンショット範囲をショートカットで翻訳します
ko: 선택한 텍스트나 스크린샷 영역을 단축키로 번역합니다
pt: Traduz texto selecionado ou regiões de captura de tela com atalhos
ru: Перевод выбранного текста или области снимка экрана по горячим клавишам
tr: Kısayollarla seçili metni veya ekran görüntüsü alanlarını çevirin
zh_hant: 透過快速鍵翻譯選取文字或截圖區域

# metadata.title
source: 翻译
ar: المترجم
de: Übersetzer
en: Translator
es: Traductor
fr: Traducteur
ja: 翻訳
ko: 번역
pt: Tradutor
ru: Переводчик
tr: Çevirmen
zh_hant: 翻譯

# openAIClient.error.emptyResponse
source: 响应为空
ar: استجابة فارغة
de: Leere Antwort
en: Empty response
es: Respuesta vacía
fr: Réponse vide
ja: 空の応答
ko: 빈 응답
pt: Resposta vazia
ru: Пустой ответ
tr: Boş yanıt
zh_hant: 響應為空

# openAIClient.error.parseFailed
source: 无法解析翻译结果
ar: تعذر تحليل نتيجة الترجمة
de: Das Übersetzungsergebnis konnte nicht analysiert werden
en: Could not parse the translation result
es: No se pudo analizar el resultado de la traducción
fr: Impossible d'analyser le résultat de la traduction
ja: 翻訳結果を解析できませんでした
ko: 번역 결과를 파싱할 수 없습니다
pt: Não foi possível analisar o resultado da tradução
ru: Не удалось проанализировать результат перевода
tr: Çeviri sonucu ayrıştırılamadı
zh_hant: 無法解析翻譯結果

# openAIClient.error.requestFailed
source: 请求失败，请稍后重试
ar: فشل الطلب. حاول مرة أخرى لاحقًا.
de: Anfrage fehlgeschlagen. Versuchen Sie es später noch einmal.
en: Request failed. Try again later.
es: La solicitud falló. Inténtalo de nuevo más tarde.
fr: La demande a échoué. Réessayez plus tard.
ja: リクエストは失敗しました。後でもう一度お試しください。
ko: 요청이 실패했습니다. 나중에 다시 시도해 보세요.
pt: Falha na solicitação. Tente novamente mais tarde.
ru: Запрос не выполнен. Повторите попытку позже.
tr: İstek başarısız oldu. Daha sonra yeniden deneyin.
zh_hant: 請求失敗，請稍後重試

# openAIClient.error.unauthorized
source: API Key 无效或无权限
ar: API Key غير صالح أو غير مصرح به
de: API Key ist ungültig oder nicht autorisiert
en: API Key is invalid or unauthorized
es: API Key no es válido o no está autorizado
fr: API Key n'est pas valide ou n'est pas autorisé
ja: API Key は無効または許可されていません
ko: API Key이 유효하지 않거나 승인되지 않았습니다
pt: API Key é inválido ou não autorizado
ru: API Key недействителен или неавторизован
tr: API Key geçersiz veya yetkisiz
zh_hant: API Key 無效或無權限

# openAIClient.providerTitle
source: OpenAI 翻译
ar: ترجمة OpenAI
de: OpenAI-Übersetzung
en: OpenAI Translation
es: Traducción de OpenAI
fr: Traduction OpenAI
ja: OpenAI 翻訳
ko: OpenAI 번역
pt: Tradução OpenAI
ru: Перевод OpenAI
tr: OpenAI Çevirisi
zh_hant: OpenAI 翻譯

# openAIConfiguration.error.blankBaseURL
source: Base URL 不能为空。
ar: لا يمكن أن تكون Base URL فارغة.
de: Base URL darf nicht leer sein.
en: Base URL cannot be empty.
es: Base URL no puede estar vacía.
fr: Base URL ne peut pas être vide.
ja: Base URL を空にすることはできません。
ko: Base URL은 비워둘 수 없습니다.
pt: Base URL não pode ficar vazia.
ru: Base URL не может быть пустым.
tr: Base URL boş olamaz.
zh_hant: Base URL 不能為空。

# openAIConfiguration.error.blankModel
source: 模型不能为空。
ar: لا يمكن ترك النموذج فارغًا.
de: Das Modell darf nicht leer sein.
en: Model cannot be empty.
es: El modelo no puede estar vacío.
fr: Le modèle ne peut pas être vide.
ja: モデルを空にすることはできません。
ko: 모델은 비워둘 수 없습니다.
pt: O modelo não pode ficar vazio.
ru: Модель не может быть пустой.
tr: Model boş olamaz.
zh_hant: 模型不能為空。

# openAIConfiguration.error.invalidBaseURL
source: Base URL 无效。
ar: Base URL غير صالحة.
de: Base URL ist ungültig.
en: Base URL is invalid.
es: Base URL no es válida.
fr: Base URL n’est pas valide.
ja: Base URL が無効です。
ko: Base URL이 잘못되었습니다.
pt: Base URL é inválida.
ru: Base URL недействителен.
tr: Base URL geçersiz.
zh_hant: Base URL 無效。

# openAIConfiguration.error.missingTextPlaceholder
source: 提示词必须包含 {{text}}。
ar: يجب أن يتضمن الموجّه {{text}}.
de: Der Prompt muss {{text}} enthalten.
en: The prompt must include {{text}}.
es: El prompt debe incluir {{text}}.
fr: Le prompt doit inclure {{text}}.
ja: プロンプトには {{text}} を含めてください。
ko: 프롬프트에는 {{text}}이 포함되어야 합니다.
pt: O prompt deve incluir {{text}}.
ru: Промпт должен содержать {{text}}.
tr: İstem {{text}} içermelidir.
zh_hant: 提示詞必須包含 {{text}}。

# panel.closeHelp
source: 关闭
ar: إغلاق
de: Schließen
en: Close
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
pt: Fechar
ru: Закрыть
tr: Kapat
zh_hant: 關閉

# panel.result.copyHelp
source: 复制译文
ar: نسخ الترجمة
de: Übersetzung kopieren
en: Copy translation
es: Copiar traducción
fr: Copier la traduction
ja: 翻訳をコピー
ko: 번역 복사
pt: Copiar tradução
ru: Копировать перевод
tr: Çeviriyi kopyala
zh_hant: 複製譯文

# panel.result.copyProviderHelpFormat
source: 复制%@译文
ar: انسخ %@ الترجمة
de: Kopieren Sie die %@-Übersetzung
en: Copy %@ translation
es: Copiar traducción %@
fr: Copier la traduction %@
ja: %@ 翻訳をコピー
ko: %@ 번역 복사
pt: Copiar tradução de %@
ru: Копировать %@ перевод
tr: %@ çevirisini kopyala
zh_hant: 複製%@譯文

# panel.result.speakHelp
source: 朗读译文
ar: تحدث الترجمة
de: Übersetzung sprechen
en: Speak translation
es: Hablar traducción
fr: Parler en traduction
ja: 翻訳を話す
ko: 번역 말하기
pt: Falar tradução
ru: Произнесите перевод
tr: Çeviriyi seslendir
zh_hant: 朗讀譯文

# panel.result.title
source: OpenAI 翻译
ar: OpenAI الترجمة
de: OpenAI Übersetzung
en: OpenAI Translation
es: OpenAI Traducción
fr: OpenAI Traduction
ja: OpenAI 翻訳
ko: OpenAI 번역
pt: OpenAI Tradução
ru: OpenAI Перевод
tr: OpenAI Çevirisi
zh_hant: OpenAI 翻譯

# panel.resultPlaceholder.emptyResponse
source: 响应为空
ar: استجابة فارغة
de: Leere Antwort
en: Empty response
es: Respuesta vacía
fr: Réponse vide
ja: 空の応答
ko: 빈 응답
pt: Resposta vazia
ru: Пустой ответ
tr: Boş yanıt
zh_hant: 響應為空

# panel.resultPlaceholder.idle
source: 等待翻译
ar: في انتظار الترجمة
de: Warten auf Übersetzung
en: Waiting for translation
es: Esperando traducción
fr: En attente de traduction
ja: 翻訳を待っています
ko: 번역을 기다리는 중
pt: Aguardando tradução
ru: Ожидание перевода
tr: Çeviri bekleniyor
zh_hant: 等待翻譯

# panel.resultPlaceholder.translating
source: 正在翻译...
ar: ترجمة...
de: Übersetzen…
en: Translating…
es: Traduciendo…
fr: Traduire…
ja: 翻訳中…
ko: 번역 중…
pt: Traduzindo…
ru: Перевод…
tr: Çevriliyor…
zh_hant: 正在翻譯...

# panel.retryHelp
source: 重试
ar: إعادة المحاولة
de: Wiederholen
en: Retry
es: Reintentar
fr: Réessayer
ja: 再試行
ko: 재시도
pt: Tentar novamente
ru: Повторить
tr: Yeniden Dene
zh_hant: 重試

# panel.settingsHelp
source: 设置
ar: الإعدادات
de: Einstellungen
en: Settings
es: Configuración
fr: Paramètres
ja: 設定
ko: 설정
pt: Configurações
ru: Настройки
tr: Ayarlar
zh_hant: 設定

# panel.tip.actionTitle
source: 如何解决
ar: كيفية الإصلاح
de: So beheben Sie das Problem
en: How to Fix
es: Cómo solucionarlo
fr: Comment réparer
ja: 修正方法
ko: 수정 방법
pt: Como corrigir
ru: Как исправить
tr: Nasıl Düzeltilir
zh_hant: 如何解決

# panel.tip.missingSelection
source: 划词翻译没有获取到文本
ar: لم تحصل ترجمة التحديد على أي نص
de: Auswahlübersetzung hat keinen Text erhalten
en: Selection translation did not get any text
es: La traducción de la selección no obtuvo ningún texto
fr: La traduction de la sélection n'a reçu aucun texte
ja: 選択部分の翻訳ではテキストが取得されませんでした
ko: 선택 번역에 텍스트가 없습니다
pt: A tradução da seleção não obteve nenhum texto
ru: Перевод выделенного фрагмента не содержит текста
tr: Seçim çevirisi herhangi bir metin alamadı
zh_hant: 劃詞翻譯沒有獲取到文本

# panel.tip.title
source: 提示
ar: نصيحة
de: Tipp
en: Tip
es: Consejo
fr: Conseil
ja: ヒント
ko: 팁
pt: Dica
ru: Совет
tr: İpucu

# panel.source.copyHelp
source: 复制原文
ar: نسخ النص المصدر
de: Quelltext kopieren
en: Copy source text
es: Copiar texto fuente
fr: Copier le texte source
ja: ソーステキストをコピー
ko: 원본 텍스트 복사
pt: Copiar texto fonte
ru: Копировать исходный текст
tr: Kaynak metni kopyala
zh_hant: 複製原文

# panel.source.speakHelp
source: 朗读原文
ar: نطق النص المصدر
de: Quelltext vorlesen
en: Speak source text
es: Hablar el texto fuente
fr: Prononcer le texte source
ja: ソーステキストを読み上げる
ko: 원본 텍스트 말하기
pt: Falar o texto fonte
ru: Произнесите исходный текст
tr: Kaynak metni seslendir
zh_hant: 朗讀原文

# panel.source.title
source: 原文
ar: المصدر
de: Quelle
en: Source
es: Fuente
fr: Source
ja: ソース
ko: 소스
pt: Fonte
ru: Источник
tr: Kaynak

# panel.sourcePlaceholder.capturing
source: 正在读取选中文本...
ar: قراءة النص المحدد...
de: Ausgewählten Text lesen…
en: Reading selected text…
es: Leyendo el texto seleccionado…
fr: Lecture du texte sélectionné…
ja: 選択したテキストを読んでいます…
ko: 선택한 텍스트를 읽는 중...
pt: Lendo o texto selecionado…
ru: Чтение выделенного текста…
tr: Seçili metin okunuyor…
zh_hant: 正在讀取選中文本...

# panel.sourcePlaceholder.ocr
source: 正在识别截图文字...
ar: التعرف على نص لقطة الشاشة...
de: Screenshot-Text wird erkannt…
en: Recognizing screenshot text…
es: Reconociendo el texto de la captura de pantalla…
fr: Reconnaissance du texte de la capture d'écran…
ja: スクリーンショットのテキストを認識中…
ko: 스크린샷 텍스트를 인식하는 중...
pt: Reconhecendo o texto da captura de tela…
ru: Распознавание текста на скриншоте…
tr: Ekran görüntüsü metni tanınıyor…
zh_hant: 正在識別截圖文字...

# panel.sourcePlaceholder.screenshotRegion
source: 正在选择截图区域...
ar: تحديد منطقة لقطة الشاشة...
de: Screenshot-Bereich auswählen…
en: Selecting screenshot region…
es: Seleccionando región de captura de pantalla…
fr: Sélection de la région de capture d'écran…
ja: スクリーンショットの領域を選択しています…
ko: 스크린샷 영역 선택 중…
pt: Selecionando região da captura de tela…
ru: Выбор области скриншота…
tr: Ekran görüntüsü alanı seçiliyor…
zh_hant: 正在選擇截圖區域...

# panel.sourcePlaceholder.idle
source: 等待选中文本
ar: في انتظار النص المحدد
de: Warten auf ausgewählten Text
en: Waiting for selected text
es: Esperando el texto seleccionado
fr: En attente du texte sélectionné
ja: 選択されたテキストを待機中
ko: 선택한 텍스트를 기다리는 중
pt: Aguardando texto selecionado
ru: Ожидание выделенного текста
tr: Seçili metin bekleniyor
zh_hant: 等待選中文本

# panel.subtitle.needsOpenAI
source: 需要配置 OpenAI
ar: OpenAI مطلوب الإعداد
de: OpenAI-Einrichtung erforderlich
en: OpenAI setup required
es: OpenAI requiere configuración
fr: Configuration OpenAI requise
ja: OpenAI のセットアップが必要です
ko: OpenAI 설정 필요
pt: Configuração de OpenAI necessária
ru: Требуется настройка OpenAI
tr: OpenAI kurulumu gerekli

# panel.subtitle.needsProvider
source: 需要配置翻译服务
ar: إعداد خدمة الترجمة
de: Einen Übersetzungsdienst einrichten
en: Set up a translation service
es: Configurar un servicio de traducción
fr: Configurer un service de traduction
ja: 翻訳サービスをセットアップする
ko: 번역 서비스 설정
pt: Configurar um serviço de tradução
ru: Настроить службу перевода
tr: Bir çeviri hizmeti ayarlayın
zh_hant: 需要配置翻譯服務

# panel.subtitle.permissionRequired
source: 启用前需要辅助功能授权
ar: يلزم الحصول على إذن الوصول قبل التمكين
de: Vor der Aktivierung ist eine Barrierefreiheitsberechtigung erforderlich
en: Accessibility permission required before enabling
es: Se requiere permiso de accesibilidad antes de habilitar
fr: Autorisation d'accessibilité requise avant l'activation
ja: 有効にする前にアクセシビリティ権限が必要です
ko: 활성화하기 전에 접근성 권한이 필요합니다
pt: É necessária permissão de acessibilidade antes da ativação
ru: Перед включением требуется разрешение на доступ
tr: Etkinleştirmeden önce Erişilebilirlik izni gerekli
zh_hant: 啟用前需要輔助使用授權

# panel.subtitle.ready
source: 按 ⌥D 划词，⌥S 截图
ar: اضغط على ⌥D للاختيار، و⌥S لالتقاط لقطة الشاشة
de: Drücken Sie ⌥D zur Auswahl, ⌥S für den Screenshot
en: Press ⌥D for selection, ⌥S for screenshot
es: Presione ⌥D para seleccionar, ⌥S para captura de pantalla
fr: Appuyez sur ⌥D pour la sélection, ⌥S pour la capture d'écran
ja: 選択するには ⌥D を押し、スクリーンショットには ⌥S を押します
ko: 선택하려면 ⌥D를 누르고, 스크린샷을 보려면 ⌥S를 누르세요.
pt: Pressione ⌥D para seleção, ⌥S para captura de tela
ru: Нажмите ⌥D для выбора, ⌥S для скриншота
tr: Seçim için ⌥D, ekran görüntüsü için ⌥S tuşlarına basın
zh_hant: 按 ⌥D 劃詞，⌥S 截圖

# panel.subtitle.shortcutPaused
source: 快捷键已暂停
ar: تم إيقاف الاختصار مؤقتًا
de: Verknüpfung pausiert
en: Shortcut paused
es: Atajo en pausa
fr: Raccourci mis en pause
ja: ショートカットが一時停止されました
ko: 바로가기가 일시중지되었습니다.
pt: Atalho pausado
ru: Ярлык приостановлен
tr: Kısayol duraklatıldı
zh_hant: 快速鍵已暫停

# panelError.missingAPIKey
source: 请配置 API Key
ar: أدخل API Key
de: API Key einrichten
en: Set up an API Key
es: Configura una API Key
fr: Configurer une API Key
ja: API Key を設定してください
ko: API Key 설정
pt: Configurar uma API Key
ru: Настройте API Key
tr: Bir API Key ayarlayın
zh_hant: 請配置 API Key

# panelError.missingConfiguration
source: 请先配置 OpenAI
ar: قم بتكوين OpenAI أولاً.
de: Konfigurieren Sie zuerst OpenAI.
en: Configure OpenAI first.
es: Configura OpenAI primero.
fr: Configurez d'abord OpenAI.
ja: 最初に OpenAI を構成します。
ko: 먼저 OpenAI을 구성하세요.
pt: Configure OpenAI primeiro.
ru: Сначала настройте OpenAI.
tr: Önce OpenAI hizmetini yapılandırın.
zh_hant: 請先配置 OpenAI

# panelError.missingProvider
source: 请先启用翻译服务
ar: قم بتمكين خدمة الترجمة أولاً
de: Aktivieren Sie zuerst einen Übersetzungsdienst
en: Enable a translation service first
es: Primero habilite un servicio de traducción
fr: Activez d'abord un service de traduction
ja: 最初に翻訳サービスを有効にしてください
ko: 먼저 번역 서비스를 활성화하세요
pt: Ative primeiro um serviço de tradução
ru: Сначала включите службу перевода
tr: Önce bir çeviri hizmetini etkinleştirin
zh_hant: 請先啟用翻譯服務

# panelError.missingSelection
source: 未找到选中文本
ar: لم يتم العثور على نص محدد
de: Kein ausgewählter Text gefunden
en: No selected text found
es: No se encontró ningún texto seleccionado
fr: Aucun texte sélectionné trouvé
ja: 選択したテキストが見つかりません
ko: 선택한 텍스트가 없습니다
pt: Nenhum texto selecionado encontrado
ru: Выделенный текст не найден
tr: Seçili metin bulunamadı
zh_hant: 未找到選中文本

# panelError.missingOCRText
source: 截图中没有识别到文字
ar: لم يتم التعرف على أي نص في لقطة الشاشة
de: Im Screenshot wurde kein Text erkannt
en: No text recognized in the screenshot
es: No se reconoce texto en la captura de pantalla
fr: Aucun texte reconnu dans la capture d'écran
ja: スクリーンショットにテキストが認識されません
ko: 스크린샷에서 텍스트가 인식되지 않습니다
pt: Nenhum texto reconhecido na captura de tela
ru: Текст на скриншоте не распознан
tr: Ekran görüntüsünde metin tanımlanamadı
zh_hant: 截圖中沒有識別到文字

# panelError.permissionRequired
source: 需要辅助功能授权
ar: مطلوب إذن الوصول
de: Zugriffsberechtigung erforderlich
en: Accessibility permission required
es: Se requiere permiso de accesibilidad
fr: Autorisation d'accessibilité requise
ja: アクセシビリティ許可が必要です
ko: 접근성 권한이 필요합니다
pt: Permissão de acessibilidade necessária
ru: Требуется разрешение на доступ
tr: Erişilebilirlik izni gerekli
zh_hant: 需要輔助使用授權

# panelError.screenRecordingPermissionRequired
source: 需要屏幕录制授权
ar: مطلوب إذن تسجيل الشاشة
de: Bildschirmaufzeichnungsberechtigung erforderlich
en: Screen Recording permission required
es: Se requiere permiso de grabación de pantalla
fr: Autorisation d'enregistrement d'écran requise
ja: 画面録画の許可が必要です
ko: 화면 녹화 권한이 필요합니다
pt: Permissão de gravação de tela necessária
ru: Требуется разрешение на запись экрана
tr: Ekran Kaydı izni gerekli
zh_hant: 需要螢幕錄製授權

# panelError.screenshotCancelled
source: 已取消截图
ar: تم إلغاء لقطة الشاشة
de: Screenshot abgebrochen
en: Screenshot cancelled
es: Captura de pantalla cancelada
fr: Capture d'écran annulée
ja: スクリーンショットがキャンセルされました
ko: 스크린샷이 취소되었습니다
pt: Captura de tela cancelada
ru: Скриншот отменен
tr: Ekran görüntüsü iptal edildi
zh_hant: 已取消截圖

# panelError.screenshotFailed
source: 截图失败
ar: فشلت لقطة الشاشة
de: Screenshot fehlgeschlagen
en: Screenshot failed
es: Error en la captura de pantalla
fr: Échec de la capture d'écran
ja: スクリーンショットが失敗しました
ko: 스크린샷 실패
pt: Falha na captura de tela
ru: Не удалось сделать снимок экрана
tr: Ekran görüntüsü alınamadı
zh_hant: 截圖失敗
